src/DataProcessors/РаботаСEXCEL/РаботаСEXCEL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСEXCEL</name>
  <attributes>
    <name>ДатаПрайсЛиста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦеныПродажи</name>
    <type>
      <types>EnumRef.ВидыЦенПродажи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>EnumRef.ВидыЦенПродажи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/РаботаСEXCEL/Forms/Форма/Module.bsl
// Обработка "РаботаСEXCEL"
// Предназначена для загрузки прайс-листов из внешних Excel-файлов
// в регистр сведений "ЦеныНоменклатуры".
// Реквизиты формы: ДатаПрайсЛиста (Дата), ВидЦены (ПеречислениеСсылка.ВидыЦен)
// Команда "ЗагрузитьПрайсЛист" расположена на форме.

// ============================================================
//  Клиентские процедуры (диалог и инициирование загрузки)
// ============================================================

// Обработчик команды "ЗагрузитьПрайсЛист".
// Проверяет заполнение обязательных реквизитов формы (дата и вид цены),
// формирует структуру параметров и запускает процесс выбора файла.
&НаКлиенте
Процедура ЗагрузитьПрайсЛист(Команда)
    Если Не ЗначениеЗаполнено(Объект.ДатаПрайсЛиста) Тогда
        Сообщить("Не указана дата прайс-листа!");
        Возврат;
    КонецЕсли;
    Если Не ЗначениеЗаполнено(Объект.ВидЦеныПродажи) Тогда
        Сообщить("Не указан вид цены!");
        Возврат;
    КонецЕсли;
    
    ПараметрыЗагрузки = Новый Структура;
    ПараметрыЗагрузки.Вставить("СпособЗагрузки", "ТабличныйДокумент");
    ПараметрыЗагрузки.Вставить("ДатаПрайсЛиста", Объект.ДатаПрайсЛиста);
    ПараметрыЗагрузки.Вставить("ВидЦеныПродажи", Объект.ВидЦеныПродажи);
    
    СкопироватьФайлНаСервер(ПараметрыЗагрузки);
КонецПроцедуры

// Инициирует диалог выбора файла и асинхронное копирование файла на сервер.
// Параметры:
//   ПараметрыЗагрузки - Структура - Структура с ключами "ДатаПрайсЛиста", "ВидЦеныПродажи", "СпособЗагрузки".
&НаКлиенте
Процедура СкопироватьФайлНаСервер(ПараметрыЗагрузки)
    ОповещениеОЗавершении = Новый ОписаниеОповещения("СкопироватьФайлНаСерверЗавершение", ЭтотОбъект, ПараметрыЗагрузки);
    ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов("Выберите файл прайс-листа", Ложь, "Excel файлы (*.xls, *.xlsx)|*.xls;*.xlsx");
    НачатьПомещениеФайлаНаСервер(ОповещениеОЗавершении, , , , ПараметрыДиалога, УникальныйИдентификатор);
КонецПроцедуры

// Обработчик завершения копирования файла на сервер.
// Если файл помещён успешно, запускает серверную процедуру загрузки.
&НаКлиенте
Процедура СкопироватьФайлНаСерверЗавершение(ОписаниеПомещенногоФайла, ПараметрыЗагрузки) Экспорт
    Если ОписаниеПомещенногоФайла <> Неопределено Тогда
        АдресФайлаВХранилище = ОписаниеПомещенногоФайла.Адрес;
        ЗагрузитьПрайсЛистНаСервере(АдресФайлаВХранилище, ПараметрыЗагрузки.ДатаПрайсЛиста, ПараметрыЗагрузки.ВидЦеныПродажи);
    КонецЕсли;
КонецПроцедуры

// ============================================================
//  Серверные процедуры (чтение, парсинг, запись в регистр)
// ============================================================

// Основная процедура загрузки прайс-листа.
// Параметры:
//   АдресФайлаВХранилище - Строка - адрес файла во временном хранилище (ссылка на помещённый файл).
//   ДатаПрайсЛиста - Дата - Дата, на которую устанавливаются цены.
//   ВидЦеныПродажи - ПеречислениеСсылка.ВидыЦенПродажи - вид загружаемых цен.
&НаСервереБезКонтекста
Процедура ЗагрузитьПрайсЛистНаСервере(АдресФайлаВХранилище, ДатаПрайсЛиста, ВидЦеныПродажи)
    Попытка
        // Чтение Excel-файла в табличный документ.
        ТабДок = ПрочитатьФайл(АдресФайлаВХранилище);
        // Преобразование табличного документа в таблицу значений (парсинг).
        ТаблицаПрайсЛиста = ЗаполнитьТаблицуЗначенийИзТабличногоДокумента(ТабДок);
        
        Если ТаблицаПрайсЛиста.Количество() = 0 Тогда
            СообщениеПользователю = Новый СообщениеПользователю();
            СообщениеПользователю.Текст = "Выбранный файл не содержит строк с ценами!";
            СообщениеПользователю.Сообщить();
            Возврат;
        КонецЕсли;
        
        // Запись цен в регистр сведений.
        КоличествоЗагруженных = ЗагрузитьЦеныВРегистр(ТаблицаПрайсЛиста, ДатаПрайсЛиста, ВидЦеныПродажи);
        
        СообщениеПользователю = Новый СообщениеПользователю();
        СообщениеПользователю.Текст = СтрШаблон("Загружено цен: %1", КоличествоЗагруженных);
        СообщениеПользователю.Сообщить();
        
    Исключение
        СообщениеПользователю = Новый СообщениеПользователю();
        СообщениеПользователю.Текст = "Ошибка загрузки прайс-листа: " + ОписаниеОшибки();
        СообщениеПользователю.Сообщить();
    КонецПопытки;
КонецПроцедуры

// Считывает Excel-файл из временного хранилища в объект ТабличныйДокумент.
// Параметры:
//   АдресФайлаВХранилище - Строка - адрес файла во временном хранилище (ссылка на помещённый файл).
// Возвращает:
//   ТабличныйДокумент - содержимое Excel-файла (только текст, без формул и оформления).
// Учебное упрощение: используется встроенное чтение Excel (через ТабличныйДокумент.Прочитать),
// которое не сохраняет сложное форматирование и может некорректно обрабатывать некоторые файлы.
&НаСервереБезКонтекста
Функция ПрочитатьФайл(АдресФайлаВХранилище)
    ТабДок = Новый ТабличныйДокумент;
    ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xlsx");
    
    Попытка
        ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище);
        ДвоичныеДанные.Записать(ИмяВременногоФайла);
        ТабДок.Прочитать(ИмяВременногоФайла);
    Исключение
        УдалитьФайлы(ИмяВременногоФайла);
        ВызватьИсключение "Ошибка чтения файла: " + ОписаниеОшибки();
    КонецПопытки;
    
    УдалитьФайлы(ИмяВременногоФайла); // удаляем в любом случае после успеха
    
    Возврат ТабДок;
КонецФункции

// Извлекает из табличного документа строки с данными (начиная со второй строки)
// и формирует таблицу значений с колонками Номенклатура (наименование), Код, Цена.
// Предполагается, что файл содержит 4 колонки: 
//   A – не используется, B – наименование, C – код (артикул), D – цена.
// Это учебное соглашение о формате.
&НаСервереБезКонтекста
Функция ЗаполнитьТаблицуЗначенийИзТабличногоДокумента(ТабДок)
    ТаблицаПрайсЛиста = Новый ТаблицаЗначений;
    ТаблицаПрайсЛиста.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
    ТаблицаПрайсЛиста.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20))); // длина как у кода номенклатуры
    ТаблицаПрайсЛиста.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", , Новый КвалификаторыЧисла(10,2)));
    
    ТекущаяСтрока = 2; // пропускаем заголовок (первая строка – шапка таблицы)
    Пока Истина Цикл
        Область = ТабДок.ПолучитьОбласть("R" + Формат(ТекущаяСтрока, "ЧГ=0;") + "C2");
        Если Область = Неопределено Тогда Прервать; КонецЕсли;
        ТекстНоменклатуры = СокрЛП(Область.ТекущаяОбласть.Текст);
        
        Если ТекстНоменклатуры = "" Тогда
            // Если наименование пустое, проверяем следующую строку – может быть конец данных.
            ОбластьСлед = ТабДок.ПолучитьОбласть("R" + Формат(ТекущаяСтрока + 1, "ЧГ=0;") + "C2");
            Если ОбластьСлед = Неопределено Или СокрЛП(ОбластьСлед.ТекущаяОбласть.Текст) = "" Тогда Прервать; КонецЕсли;
        КонецЕсли;
        
        Попытка
            НоваяСтрока = ТаблицаПрайсЛиста.Добавить();
            НоваяСтрока.Номенклатура = ТекстНоменклатуры;
            
            ОбластьКод = ТабДок.ПолучитьОбласть("R" + Формат(ТекущаяСтрока, "ЧГ=0;") + "C3");
            НоваяСтрока.Код = СокрЛП(ОбластьКод.ТекущаяОбласть.Текст);
            
            ОбластьЦена = ТабДок.ПолучитьОбласть("R" + Формат(ТекущаяСтрока, "ЧГ=0;") + "C4");
            СтрокаЦена = СокрЛП(ОбластьЦена.ТекущаяОбласть.Текст);
            // Учебное упрощение: замена запятой на точку для корректного преобразования в число.
            СтрокаЦена = СтрЗаменить(СтрокаЦена, ",", ".");
            СтрокаЦена = СтрЗаменить(СтрокаЦена, " ", "");
            НоваяСтрока.Цена = Число(СтрокаЦена);
        Исключение
            Сообщить("Ошибка при чтении строки " + ТекущаяСтрока + ": " + ОписаниеОшибки());
        КонецПопытки;
        
        ТекущаяСтрока = ТекущаяСтрока + 1;
    КонецЦикла;
    
    Возврат ТаблицаПрайсЛиста;
КонецФункции

// Записывает цены в регистр сведений "ЦеныНоменклатуры".
// Сначала удаляет старые записи для заданной даты и вида цены (записывая пустой набор с отбором),
// затем добавляет новые на основе переданной таблицы и записывает с замещением.
// Параметры:
//   ТаблицаПрайсЛиста - ТаблицаЗначений - таблица с колонками Код, Цена.
//   ДатаПрайсЛиста - Дата - дата установки цен.
//   ВидЦеныПродажи - ПеречислениеСсылка.ВидыЦенПродажи - вид цены.
// Возвращает:
//   Число - количество загруженных записей.
&НаСервереБезКонтекста
Функция ЗагрузитьЦеныВРегистр(ТаблицаПрайсЛиста, ДатаПрайсЛиста, ВидЦеныПродажи)
    // Сопоставление номенклатуры по артикулу (коду) через запрос с временной таблицей.
    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ТаблицаПрайсЛиста", ТаблицаПрайсЛиста);
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ТаблицаПрайсЛиста.Код КАК Код,
    |    ТаблицаПрайсЛиста.Цена КАК Цена
    |ПОМЕСТИТЬ ВТ_ТаблицаПрайсЛиста
    |ИЗ
    |    &ТаблицаПрайсЛиста КАК ТаблицаПрайсЛиста
    |;
    |
    |ВЫБРАТЬ
    |    Ном.Ссылка КАК Номенклатура,
    |    ВТ_ТаблицаПрайсЛиста.Цена КАК Цена
    |ИЗ
    |    ВТ_ТаблицаПрайсЛиста КАК ВТ_ТаблицаПрайсЛиста
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
    |        ПО ВТ_ТаблицаПрайсЛиста.Код = Ном.Код";
    
    Результат = Запрос.Выполнить();
    Если Результат.Пустой() Тогда
        Сообщить("Не найдено ни одной номенклатуры по артикулам из файла.");
        Возврат 0;
    КонецЕсли;
    
    // Подготовка набора записей регистра: удаляем старые цены с той же датой и видом.
    НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Период.Установить(ДатаПрайсЛиста);
    НаборЗаписей.Отбор.ВидЦены.Установить(ВидЦеныПродажи);
    НаборЗаписей.Записать(); // запись пустого набора с отбором очищает старые записи
    
    КоличествоЗагружено = 0;
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        Запись = НаборЗаписей.Добавить();
        Запись.Период = ДатаПрайсЛиста;
        Запись.ВидЦены = ВидЦеныПродажи;
        Запись.Номенклатура = Выборка.Номенклатура;
        Запись.Цена = Выборка.Цена;
        КоличествоЗагружено = КоличествоЗагружено + 1;
    КонецЦикла;
    
    НаборЗаписей.Записать(Истина); // Истина – замещение записей (на случай дубликатов)
    Возврат КоличествоЗагружено;
КонецФункции
